MikroElektronika/core_packages/PIC/XC8/def/PIC16F18446/mcu.h
extern volatile PWM7DCHbits_t PWM7DCHbits __at(0x391);
// bitfield macros
#define _PWM7DCH_DC_POSN                                    0x0
#define _PWM7DCH_DC_POSITION                                0x0
#define _PWM7DCH_DC_SIZE                                    0x8
#define _PWM7DCH_DC_LENGTH                                  0x8
#define _PWM7DCH_DC_MASK                                    0xFF
#define _PWM7DCH_DC2_POSN                                   0x0
#define _PWM7DCH_DC2_POSITION                               0x0
#define _PWM7DCH_DC2_SIZE                                   0x1
#define _PWM7DCH_DC2_LENGTH                                 0x1
#define _PWM7DCH_DC2_MASK                                   0x1
#define _PWM7DCH_DC3_POSN                                   0x1
#define _PWM7DCH_DC3_POSITION                               0x1
#define _PWM7DCH_DC3_SIZE                                   0x1
#define _PWM7DCH_DC3_LENGTH                                 0x1
#define _PWM7DCH_DC3_MASK                                   0x2
#define _PWM7DCH_DC4_POSN                                   0x2
#define _PWM7DCH_DC4_POSITION                               0x2
#define _PWM7DCH_DC4_SIZE                                   0x1
#define _PWM7DCH_DC4_LENGTH                                 0x1
#define _PWM7DCH_DC4_MASK                                   0x4
#define _PWM7DCH_DC5_POSN                                   0x3
#define _PWM7DCH_DC5_POSITION                               0x3
#define _PWM7DCH_DC5_SIZE                                   0x1
#define _PWM7DCH_DC5_LENGTH                                 0x1
#define _PWM7DCH_DC5_MASK                                   0x8
#define _PWM7DCH_DC6_POSN                                   0x4
#define _PWM7DCH_DC6_POSITION                               0x4
#define _PWM7DCH_DC6_SIZE                                   0x1
#define _PWM7DCH_DC6_LENGTH                                 0x1
#define _PWM7DCH_DC6_MASK                                   0x10
#define _PWM7DCH_DC7_POSN                                   0x5
#define _PWM7DCH_DC7_POSITION                               0x5
#define _PWM7DCH_DC7_SIZE                                   0x1
#define _PWM7DCH_DC7_LENGTH                                 0x1
#define _PWM7DCH_DC7_MASK                                   0x20
#define _PWM7DCH_DC8_POSN                                   0x6
#define _PWM7DCH_DC8_POSITION                               0x6
#define _PWM7DCH_DC8_SIZE                                   0x1
#define _PWM7DCH_DC8_LENGTH                                 0x1
#define _PWM7DCH_DC8_MASK                                   0x40
#define _PWM7DCH_DC9_POSN                                   0x7
#define _PWM7DCH_DC9_POSITION                               0x7
#define _PWM7DCH_DC9_SIZE                                   0x1
#define _PWM7DCH_DC9_LENGTH                                 0x1
#define _PWM7DCH_DC9_MASK                                   0x80
#define _PWM7DCH_PWM7DC2_POSN                               0x0
#define _PWM7DCH_PWM7DC2_POSITION                           0x0
#define _PWM7DCH_PWM7DC2_SIZE                               0x1
#define _PWM7DCH_PWM7DC2_LENGTH                             0x1
#define _PWM7DCH_PWM7DC2_MASK                               0x1
#define _PWM7DCH_PWM7DC3_POSN                               0x1
#define _PWM7DCH_PWM7DC3_POSITION                           0x1
#define _PWM7DCH_PWM7DC3_SIZE                               0x1
#define _PWM7DCH_PWM7DC3_LENGTH                             0x1
#define _PWM7DCH_PWM7DC3_MASK                               0x2
#define _PWM7DCH_PWM7DC4_POSN                               0x2
#define _PWM7DCH_PWM7DC4_POSITION                           0x2
#define _PWM7DCH_PWM7DC4_SIZE                               0x1
#define _PWM7DCH_PWM7DC4_LENGTH                             0x1
#define _PWM7DCH_PWM7DC4_MASK                               0x4
#define _PWM7DCH_PWM7DC5_POSN                               0x3
#define _PWM7DCH_PWM7DC5_POSITION                           0x3
#define _PWM7DCH_PWM7DC5_SIZE                               0x1
#define _PWM7DCH_PWM7DC5_LENGTH                             0x1
#define _PWM7DCH_PWM7DC5_MASK                               0x8
#define _PWM7DCH_PWM7DC6_POSN                               0x4
#define _PWM7DCH_PWM7DC6_POSITION                           0x4
#define _PWM7DCH_PWM7DC6_SIZE                               0x1
#define _PWM7DCH_PWM7DC6_LENGTH                             0x1
#define _PWM7DCH_PWM7DC6_MASK                               0x10
#define _PWM7DCH_PWM7DC7_POSN                               0x5
#define _PWM7DCH_PWM7DC7_POSITION                           0x5
#define _PWM7DCH_PWM7DC7_SIZE                               0x1
#define _PWM7DCH_PWM7DC7_LENGTH                             0x1
#define _PWM7DCH_PWM7DC7_MASK                               0x20
#define _PWM7DCH_PWM7DC8_POSN                               0x6
#define _PWM7DCH_PWM7DC8_POSITION                           0x6
#define _PWM7DCH_PWM7DC8_SIZE                               0x1
#define _PWM7DCH_PWM7DC8_LENGTH                             0x1
#define _PWM7DCH_PWM7DC8_MASK                               0x40
#define _PWM7DCH_PWM7DC9_POSN                               0x7
#define _PWM7DCH_PWM7DC9_POSITION                           0x7
#define _PWM7DCH_PWM7DC9_SIZE                               0x1
#define _PWM7DCH_PWM7DC9_LENGTH                             0x1
#define _PWM7DCH_PWM7DC9_MASK                               0x80
#define _PWM7DCH_PWMPW2_POSN                                0x0
#define _PWM7DCH_PWMPW2_POSITION                            0x0
#define _PWM7DCH_PWMPW2_SIZE                                0x1
#define _PWM7DCH_PWMPW2_LENGTH                              0x1
#define _PWM7DCH_PWMPW2_MASK                                0x1
#define _PWM7DCH_PWMPW3_POSN                                0x1
#define _PWM7DCH_PWMPW3_POSITION                            0x1
#define _PWM7DCH_PWMPW3_SIZE                                0x1
#define _PWM7DCH_PWMPW3_LENGTH                              0x1
#define _PWM7DCH_PWMPW3_MASK                                0x2
#define _PWM7DCH_PWMPW4_POSN                                0x2
#define _PWM7DCH_PWMPW4_POSITION                            0x2
#define _PWM7DCH_PWMPW4_SIZE                                0x1
#define _PWM7DCH_PWMPW4_LENGTH                              0x1
#define _PWM7DCH_PWMPW4_MASK                                0x4
#define _PWM7DCH_PWMPW5_POSN                                0x3
#define _PWM7DCH_PWMPW5_POSITION                            0x3
#define _PWM7DCH_PWMPW5_SIZE                                0x1
#define _PWM7DCH_PWMPW5_LENGTH                              0x1
#define _PWM7DCH_PWMPW5_MASK                                0x8
#define _PWM7DCH_PWMPW6_POSN                                0x4
#define _PWM7DCH_PWMPW6_POSITION                            0x4
#define _PWM7DCH_PWMPW6_SIZE                                0x1
#define _PWM7DCH_PWMPW6_LENGTH                              0x1
#define _PWM7DCH_PWMPW6_MASK                                0x10
#define _PWM7DCH_PWMPW7_POSN                                0x5
#define _PWM7DCH_PWMPW7_POSITION                            0x5
#define _PWM7DCH_PWMPW7_SIZE                                0x1
#define _PWM7DCH_PWMPW7_LENGTH                              0x1
#define _PWM7DCH_PWMPW7_MASK                                0x20
#define _PWM7DCH_PWMPW8_POSN                                0x6
#define _PWM7DCH_PWMPW8_POSITION                            0x6
#define _PWM7DCH_PWMPW8_SIZE                                0x1
#define _PWM7DCH_PWMPW8_LENGTH                              0x1
#define _PWM7DCH_PWMPW8_MASK                                0x40
#define _PWM7DCH_PWMPW9_POSN                                0x7
#define _PWM7DCH_PWMPW9_POSITION                            0x7
#define _PWM7DCH_PWMPW9_SIZE                                0x1
#define _PWM7DCH_PWMPW9_LENGTH                              0x1
#define _PWM7DCH_PWMPW9_MASK                                0x80

// Register: PWM7CON
#define PWM7CON PWM7CON
extern volatile unsigned char           PWM7CON             __at(0x392);
#ifndef _LIB_BUILD
asm("PWM7CON equ 0392h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :4;
        unsigned POL                    :1;
        unsigned OUT                    :1;
        unsigned                        :1;
        unsigned EN                     :1;
    };
    struct {
        unsigned                        :4;
        unsigned PWM7POL                :1;
        unsigned PWM7OUT                :1;
        unsigned                        :1;
        unsigned PWM7EN                 :1;
    };
} PWM7CONbits_t;
