MikroElektronika/core_packages/PIC/XC8/def/PIC16F18446/mcu.h
// Register: CK1PPS
#define CK1PPS CK1PPS
extern volatile unsigned char           CK1PPS              __at(0x1ECC);
#ifndef _LIB_BUILD
asm("CK1PPS equ 01ECCh");
#endif
// aliases
extern volatile unsigned char           TX1CKPPS            __at(0x1ECC);
#ifndef _LIB_BUILD
asm("TX1CKPPS equ 01ECCh");
#endif
extern volatile unsigned char           CKPPS               __at(0x1ECC);
#ifndef _LIB_BUILD
asm("CKPPS equ 01ECCh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :2;
    };
    struct {
        unsigned CK1PPS                 :5;
    };
    struct {
        unsigned CK1PPS0                :1;
        unsigned CK1PPS1                :1;
        unsigned CK1PPS2                :1;
        unsigned CK1PPS3                :1;
        unsigned CK1PPS4                :1;
    };
} CK1PPSbits_t;
extern volatile CK1PPSbits_t CK1PPSbits __at(0x1ECC);
// bitfield macros
#define _CK1PPS_PIN_POSN                                    0x0
#define _CK1PPS_PIN_POSITION                                0x0
#define _CK1PPS_PIN_SIZE                                    0x3
#define _CK1PPS_PIN_LENGTH                                  0x3
#define _CK1PPS_PIN_MASK                                    0x7
#define _CK1PPS_PORT_POSN                                   0x3
#define _CK1PPS_PORT_POSITION                               0x3
#define _CK1PPS_PORT_SIZE                                   0x2
#define _CK1PPS_PORT_LENGTH                                 0x2
#define _CK1PPS_PORT_MASK                                   0x18
#define _CK1PPS_CK1PPS_POSN                                 0x0
#define _CK1PPS_CK1PPS_POSITION                             0x0
#define _CK1PPS_CK1PPS_SIZE                                 0x5
#define _CK1PPS_CK1PPS_LENGTH                               0x5
#define _CK1PPS_CK1PPS_MASK                                 0x1F
#define _CK1PPS_CK1PPS0_POSN                                0x0
#define _CK1PPS_CK1PPS0_POSITION                            0x0
#define _CK1PPS_CK1PPS0_SIZE                                0x1
#define _CK1PPS_CK1PPS0_LENGTH                              0x1
#define _CK1PPS_CK1PPS0_MASK                                0x1
#define _CK1PPS_CK1PPS1_POSN                                0x1
#define _CK1PPS_CK1PPS1_POSITION                            0x1
#define _CK1PPS_CK1PPS1_SIZE                                0x1
#define _CK1PPS_CK1PPS1_LENGTH                              0x1
#define _CK1PPS_CK1PPS1_MASK                                0x2
#define _CK1PPS_CK1PPS2_POSN                                0x2
#define _CK1PPS_CK1PPS2_POSITION                            0x2
#define _CK1PPS_CK1PPS2_SIZE                                0x1
#define _CK1PPS_CK1PPS2_LENGTH                              0x1
#define _CK1PPS_CK1PPS2_MASK                                0x4
#define _CK1PPS_CK1PPS3_POSN                                0x3
#define _CK1PPS_CK1PPS3_POSITION                            0x3
#define _CK1PPS_CK1PPS3_SIZE                                0x1
#define _CK1PPS_CK1PPS3_LENGTH                              0x1
#define _CK1PPS_CK1PPS3_MASK                                0x8
#define _CK1PPS_CK1PPS4_POSN                                0x4
#define _CK1PPS_CK1PPS4_POSITION                            0x4
#define _CK1PPS_CK1PPS4_SIZE                                0x1
#define _CK1PPS_CK1PPS4_LENGTH                              0x1
#define _CK1PPS_CK1PPS4_MASK                                0x10
// alias bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :2;
    };
    struct {
        unsigned CK1PPS                 :5;
    };
    struct {
        unsigned CK1PPS0                :1;
        unsigned CK1PPS1                :1;
        unsigned CK1PPS2                :1;
        unsigned CK1PPS3                :1;
        unsigned CK1PPS4                :1;
    };
} TX1CKPPSbits_t;
extern volatile TX1CKPPSbits_t TX1CKPPSbits __at(0x1ECC);
// bitfield macros
#define _TX1CKPPS_PIN_POSN                                  0x0
#define _TX1CKPPS_PIN_POSITION                              0x0
#define _TX1CKPPS_PIN_SIZE                                  0x3
#define _TX1CKPPS_PIN_LENGTH                                0x3
#define _TX1CKPPS_PIN_MASK                                  0x7
#define _TX1CKPPS_PORT_POSN                                 0x3
#define _TX1CKPPS_PORT_POSITION                             0x3
#define _TX1CKPPS_PORT_SIZE                                 0x2
#define _TX1CKPPS_PORT_LENGTH                               0x2
#define _TX1CKPPS_PORT_MASK                                 0x18
#define _TX1CKPPS_CK1PPS_POSN                               0x0
#define _TX1CKPPS_CK1PPS_POSITION                           0x0
#define _TX1CKPPS_CK1PPS_SIZE                               0x5
#define _TX1CKPPS_CK1PPS_LENGTH                             0x5
#define _TX1CKPPS_CK1PPS_MASK                               0x1F
#define _TX1CKPPS_CK1PPS0_POSN                              0x0
#define _TX1CKPPS_CK1PPS0_POSITION                          0x0
#define _TX1CKPPS_CK1PPS0_SIZE                              0x1
#define _TX1CKPPS_CK1PPS0_LENGTH                            0x1
#define _TX1CKPPS_CK1PPS0_MASK                              0x1
#define _TX1CKPPS_CK1PPS1_POSN                              0x1
#define _TX1CKPPS_CK1PPS1_POSITION                          0x1
#define _TX1CKPPS_CK1PPS1_SIZE                              0x1
#define _TX1CKPPS_CK1PPS1_LENGTH                            0x1
#define _TX1CKPPS_CK1PPS1_MASK                              0x2
#define _TX1CKPPS_CK1PPS2_POSN                              0x2
#define _TX1CKPPS_CK1PPS2_POSITION                          0x2
#define _TX1CKPPS_CK1PPS2_SIZE                              0x1
#define _TX1CKPPS_CK1PPS2_LENGTH                            0x1
#define _TX1CKPPS_CK1PPS2_MASK                              0x4
#define _TX1CKPPS_CK1PPS3_POSN                              0x3
#define _TX1CKPPS_CK1PPS3_POSITION                          0x3
#define _TX1CKPPS_CK1PPS3_SIZE                              0x1
#define _TX1CKPPS_CK1PPS3_LENGTH                            0x1
#define _TX1CKPPS_CK1PPS3_MASK                              0x8
#define _TX1CKPPS_CK1PPS4_POSN                              0x4
#define _TX1CKPPS_CK1PPS4_POSITION                          0x4
#define _TX1CKPPS_CK1PPS4_SIZE                              0x1
#define _TX1CKPPS_CK1PPS4_LENGTH                            0x1
#define _TX1CKPPS_CK1PPS4_MASK                              0x10
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :2;
    };
    struct {
        unsigned CK1PPS                 :5;
    };
    struct {
        unsigned CK1PPS0                :1;
        unsigned CK1PPS1                :1;
        unsigned CK1PPS2                :1;
        unsigned CK1PPS3                :1;
        unsigned CK1PPS4                :1;
    };
} CKPPSbits_t;
extern volatile CKPPSbits_t CKPPSbits __at(0x1ECC);
// bitfield macros
#define _CKPPS_PIN_POSN                                     0x0
#define _CKPPS_PIN_POSITION                                 0x0
#define _CKPPS_PIN_SIZE                                     0x3
#define _CKPPS_PIN_LENGTH                                   0x3
#define _CKPPS_PIN_MASK                                     0x7
#define _CKPPS_PORT_POSN                                    0x3
#define _CKPPS_PORT_POSITION                                0x3
#define _CKPPS_PORT_SIZE                                    0x2
#define _CKPPS_PORT_LENGTH                                  0x2
#define _CKPPS_PORT_MASK                                    0x18
#define _CKPPS_CK1PPS_POSN                                  0x0
#define _CKPPS_CK1PPS_POSITION                              0x0
#define _CKPPS_CK1PPS_SIZE                                  0x5
#define _CKPPS_CK1PPS_LENGTH                                0x5
#define _CKPPS_CK1PPS_MASK                                  0x1F
#define _CKPPS_CK1PPS0_POSN                                 0x0
#define _CKPPS_CK1PPS0_POSITION                             0x0
#define _CKPPS_CK1PPS0_SIZE                                 0x1
#define _CKPPS_CK1PPS0_LENGTH                               0x1
#define _CKPPS_CK1PPS0_MASK                                 0x1
#define _CKPPS_CK1PPS1_POSN                                 0x1
#define _CKPPS_CK1PPS1_POSITION                             0x1
#define _CKPPS_CK1PPS1_SIZE                                 0x1
#define _CKPPS_CK1PPS1_LENGTH                               0x1
#define _CKPPS_CK1PPS1_MASK                                 0x2
#define _CKPPS_CK1PPS2_POSN                                 0x2
#define _CKPPS_CK1PPS2_POSITION                             0x2
#define _CKPPS_CK1PPS2_SIZE                                 0x1
#define _CKPPS_CK1PPS2_LENGTH                               0x1
#define _CKPPS_CK1PPS2_MASK                                 0x4
#define _CKPPS_CK1PPS3_POSN                                 0x3
#define _CKPPS_CK1PPS3_POSITION                             0x3
#define _CKPPS_CK1PPS3_SIZE                                 0x1
#define _CKPPS_CK1PPS3_LENGTH                               0x1
#define _CKPPS_CK1PPS3_MASK                                 0x8
#define _CKPPS_CK1PPS4_POSN                                 0x4
#define _CKPPS_CK1PPS4_POSITION                             0x4
#define _CKPPS_CK1PPS4_SIZE                                 0x1
#define _CKPPS_CK1PPS4_LENGTH                               0x1
#define _CKPPS_CK1PPS4_MASK                                 0x10

// Register: RA0PPS
#define RA0PPS RA0PPS
extern volatile unsigned char           RA0PPS              __at(0x1F10);
#ifndef _LIB_BUILD
asm("RA0PPS equ 01F10h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RA0PPS                 :6;
    };
    struct {
        unsigned RA0PPS0                :1;
        unsigned RA0PPS1                :1;
        unsigned RA0PPS2                :1;
        unsigned RA0PPS3                :1;
        unsigned RA0PPS4                :1;
        unsigned RA0PPS5                :1;
    };
} RA0PPSbits_t;
